In [1]:
import pandas as pd

In [5]:
people = {
    'first' : ['John','Manvi','Abhishek'],
    'last': ['Doe','Jha','Mishra']
}

In [6]:
people

{'first': ['John', 'Manvi', 'Abhishek'], 'last': ['Doe', 'Jha', 'Mishra']}

In [7]:
df=pd.DataFrame(people)

In [8]:
df

      first    last
0      John     Doe
1     Manvi     Jha
2  Abhishek  Mishra

In [9]:
df['email']=df['first']+df['last']+'@gmail.com'

In [10]:
df

      first    last                     email
0      John     Doe         JohnDoe@gmail.com
1     Manvi     Jha        ManviJha@gmail.com
2  Abhishek  Mishra  AbhishekMishra@gmail.com

In [11]:
df['name']=df['first']+' '+df['last']

In [12]:
df

      first    last                     email             name
0      John     Doe         JohnDoe@gmail.com         John Doe
1     Manvi     Jha        ManviJha@gmail.com        Manvi Jha
2  Abhishek  Mishra  AbhishekMishra@gmail.com  Abhishek Mishra

In [15]:
df.drop(columns=['first','last'],inplace=True)

In [16]:
df

                      email             name
0         JohnDoe@gmail.com         John Doe
1        ManviJha@gmail.com        Manvi Jha
2  AbhishekMishra@gmail.com  Abhishek Mishra

In [21]:
df['name'].str.split(' ',expand=True)

          0       1
0      John     Doe
1     Manvi     Jha
2  Abhishek  Mishra

In [22]:
df[['first','last']]=df['name'].str.split(' ',expand=True)

In [23]:
df

                      email             name     first    last
0         JohnDoe@gmail.com         John Doe      John     Doe
1        ManviJha@gmail.com        Manvi Jha     Manvi     Jha
2  AbhishekMishra@gmail.com  Abhishek Mishra  Abhishek  Mishra

In [26]:
df.drop(columns='name',inplace=True)

In [27]:
df

                      email     first    last
0         JohnDoe@gmail.com      John     Doe
1        ManviJha@gmail.com     Manvi     Jha
2  AbhishekMishra@gmail.com  Abhishek  Mishra

In [29]:
df.append({'first':'Tony'}, ignore_index=True)

                      email     first    last
0         JohnDoe@gmail.com      John     Doe
1        ManviJha@gmail.com     Manvi     Jha
2  AbhishekMishra@gmail.com  Abhishek  Mishra
3                       NaN      Tony     NaN

In [31]:
people = {
    'first' : ['Tony','Vineeta'],
    'last': ['Stark','Singh'],
    'email':['TonyStark@gmail.com','VineetaSingh@gmail.com']
}

In [33]:
df2=pd.DataFrame(people)

In [34]:
df2

     first   last                   email
0     Tony  Stark     TonyStark@gmail.com
1  Vineeta  Singh  VineetaSingh@gmail.com

In [41]:
df.append(df2,ignore_index=True)

                      email     first    last
0         JohnDoe@gmail.com      John     Doe
1        ManviJha@gmail.com     Manvi     Jha
2  AbhishekMishra@gmail.com  Abhishek  Mishra
3       TonyStark@gmail.com      Tony   Stark
4    VineetaSingh@gmail.com   Vineeta   Singh

In [42]:
df = df.append(df2,ignore_index=True)

In [43]:
df

                      email     first    last
0         JohnDoe@gmail.com      John     Doe
1        ManviJha@gmail.com     Manvi     Jha
2  AbhishekMishra@gmail.com  Abhishek  Mishra
3       TonyStark@gmail.com      Tony   Stark
4    VineetaSingh@gmail.com   Vineeta   Singh

In [45]:
filt= df[df['last']=='Stark']

In [46]:
df.dr

                 email first   last
3  TonyStark@gmail.com  Tony  Stark